app/controllers/articles_controller.rb

  def update
    @article = Article.find(params[:id])
    # Only Updates if there are any changes.
    if @article.title != params[:article][:title]
      @article.update(title: params[:article][:title])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-01-12 23:13:23.511456"], ["id", 1]]